static/logs/google-translate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2022-07-29 vie 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Plugin de Google translate</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="../style/style.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<meta name="theme-color" content="#ffffff" />
<meta name="color-scheme" content="dark light">
<link rel="icon" type="image/x-icon" href="https://galindosoft.neocities.org/logo.png" />
</head>
<body>
<div id="content">
<h1 class="title">Plugin de Google translate</h1>

<div id="outline-container-orgea840ae" class="outline-2">
<h2 id="orgea840ae">Añadir el plugin traduccion</h2>
<div class="outline-text-2" id="text-orgea840ae">
<p>
Añadir el plugin es muy sencillo de installar, simplemente tenmos que añadir el siguiente código en nuestra pagina.
NOTA: tenemos que añadir este script en <b>todas las paginas en las que queramos traducir</b>.
</p>

<pre class="example">

&lt;div id="google_translate_element"&gt;&lt;/div&gt;
&lt;script defer&gt; 
function googleTranslateElementInit() {

new google.translate.TranslateElement({

pageLanguage: 'es' // &lt;- idioma default, aquí esta en español

}, 'google_translate_element');

}
&lt;/script&gt;

&lt;script defer src="//translate.google.com/translate_a/element.js?cb=googleTranslateElementInit"&gt;
&lt;/script&gt;

</pre>
</div>
</div>



<div id="outline-container-org13772c2" class="outline-2">
<h2 id="org13772c2">Ajustes personales</h2>
<div class="outline-text-2" id="text-org13772c2">
</div>
<div id="outline-container-orga7b68ff" class="outline-3">
<h3 id="orga7b68ff">añadir "defer" en el tag script</h3>
<div class="outline-text-3" id="text-orga7b68ff">
<p>
Esto para hacer la carga del plugin sea asincrona y poder cargar nuestros propios scripts sin preocuparnos de que el plugin haya terminado de cargar.
</p>
</div>
</div>

<div id="outline-container-org732ccbb" class="outline-3">
<h3 id="org732ccbb">ocultar la lista de idiomas</h3>
<div class="outline-text-3" id="text-org732ccbb">
<p>
Para traducir todas las paginas de nuestro sitio tenemos que agregar este script en todas las paginas, podemos integrar este componente con nuestro diseño ó podemos ocultarlo con css:
</p>

<pre class="example">

#google_translate_element{
    display:none;
}

</pre>
</div>
</div>
</div>
</div>
</body>
</html>
